{
  "fil": {
    "hours": "Oras ng operasyon: Lunes–Biyernes 08:00–17:00; Sabado 08:00–12:00. Sarado tuwing Linggo at sa mga holidays.",
    "opening_days": "Bukas ang klinika Lunes hanggang Sabado. Para sa partikular na petsa (hal. special holidays), pakitingnan ang announcements o tawagan kami.",
    "appointments": "Para magpa-appointment: mag-log in at gamitin ang 'Book Appointment' page, o tumawag sa clinic hotline. Maaari ring mag-request ng petsa at oras sa loob ng app.",
    "walk_in": "Tumatanggap ng walk-in patients kapag may available na slots, pero mas mainam magpa-appointment para siguradong makakonsulta agad.",
    "reschedule": "Para mag-reschedule ng appointment, buksan ang iyong appointment sa app at piliin ang 'Reschedule' o tumawag sa clinic para tulong.",
    "cancel": "Pwede mag-cancel ng appointment sa app sa pamamagitan ng 'Cancel' button o tumawag sa clinic. May cancellation policy? Pakitingnan ang appointment terms o tumawag.",
    "contact": "Email: clinic@documed.com. Hotline: (insert clinic phone). Para sa mabilis na tugon, gamitin ang Book Appointment o tumawag sa clinic during office hours.",
    "location": "Ang klinika ay matatagpuan sa (insert clinic address). May parking area at malapit sa main gate. Para sa eksaktong directions, gamitin ang map app at hanapin ang 'DocuMed Clinic'.",
    "services": "Serbisyo: general check-ups, dental treatment (fillings, extractions), medical certificates, health counseling, at basic laboratory tests. Para sa kumpletong listahan, pumunta sa Services page.",
    "dental_procedures": "Nagbibigay kami ng dental cleaning, fillings, extractions, at simple restorative procedures. Para sa espesyal na dental surgery, maaaring mag-refer sa partner hospital.",
    "medical_certificate": "Nag-iisyu ng medical certificate pagkatapos ng konsultasyon. Dalhin ang ID at anumang kinakailangang dokumento. May fee ang certificate depende sa uri.",
    "documents_required": "Dalhin po ang valid ID at anumang referral o medical documents. Para sa students, pakita ang school ID kung kinakailangan.",
    "medical_records": "Para humiling ng medical records, mag-request sa Medical Records section sa app o mag-email sa clinic. May processing time at maaaring may maliit na fee.",
    "prescriptions": "Kung kailangan ng reseta, makukuha ito pagkatapos ng konsultasyon. Para sa refill requests, makipag-ugnayan sa klinika o sundin ang refill flow sa app.",
    "fees_payment": "Tumatanggap kami ng cash at card. Para sa mga serbisyo may nakalista na fee sa Services page. Para sa estimate, tawag o magtanong sa clinic.",
    "insurance": "Tumatanggap ng ilang insurance plans. Ipaalam sa clinic ang insurance provider bago ang appointment para sa verification.",
    "emergency": "Kung emergency (malubha na pagdurugo, hirap sa paghinga, matinding sakit), pumunta agad sa pinakamalapit na ER o tawagan ang lokal na emergency number. Klinika ang nagseserbisyo ng non-life-threatening care lamang.",
    "teleconsult": "May teleconsultation option ba? Oo—kung available, mag-book ng teleconsult sa app at susundan kayo ng staff para sa link o tawag.",
    "lab_tests": "Nag-aalok ng basic lab tests (CBC, urine analysis). Para sa partikular na tests, magtanong sa clinic para sa availability at prep instructions.",
    "referral": "Kung kailangan ng specialist referral, ang doktor ng klinika ay mag-iisyu ng referral at magbibigay ng instructions kung saan magpunta.",
    "privacy": "Pinapangalagaan namin ang patient privacy. Ang medical records ay confidential at ibabahagi lamang kung may pahintulot o ayon sa batas.",
    "covid_policy": "May mga updated na protocols para sa respiratory illness. Kung may lagnat o sintomas, ipagbigay-alam muna sa clinic bago dumating para sa tamang routing.",
    "online_portal": "Ang online portal ay ginagamit para sa pag-book, pag-view ng records, at pagkuha ng notifications. Kung may problema sa portal, i-report sa support team.",
    "account_help": "Para sa account issues (forgot password, profile update), gamitin ang Forgot Password link o i-update ang profile sa app settings. Para tulong, mag-email sa support.",
    "thanks": "Walang anuman — laging handa tumulong ang DocuMed Clinic. Kung may iba pang tanong, itanong lang dito o kontakin ang clinic.",
    "default": "Paumanhin, hindi ma-access ang AI ngayon. Para mabilis na tulong: Tingnan ang hours: Lunes–Biyernes 08:00–17:00; mag-book ng appointment sa Book Appointment page o email clinic@documed.com."
  },
  "en": {
    "hours": "Clinic hours: Mon–Fri 08:00–17:00; Sat 08:00–12:00. Closed on Sundays and public holidays.",
    "opening_days": "The clinic is open Monday to Saturday. For specific dates (e.g., special holidays) please check announcements or call us.",
    "appointments": "To book an appointment: log in and use the 'Book Appointment' page, or call the clinic hotline. You can also request a preferred date/time within the app.",
    "walk_in": "Walk-in patients are accepted when slots are available, but booking is recommended to ensure timely consultation.",
    "reschedule": "To reschedule an appointment, open your appointment in the app and choose 'Reschedule' or call the clinic for assistance.",
    "cancel": "You can cancel appointments via the app using the 'Cancel' button or by calling the clinic. See appointment terms for cancellation policy.",
    "contact": "Email: clinic@documed.com. Hotline: (insert clinic phone). For a faster response, use the Book Appointment feature or call during office hours.",
    "location": "The clinic is located at (insert clinic address). There is parking available near the main gate. For exact directions, use a maps app and search 'DocuMed Clinic'.",
    "services": "Services: general check-ups, dental treatment (fillings, extractions), medical certificates, health counseling, and basic lab tests. See the Services page for a full list.",
    "dental_procedures": "We provide dental cleaning, fillings, extractions, and simple restorative procedures. For specialized dental surgery, we may refer to a partner hospital.",
    "medical_certificate": "Medical certificates are issued after consultation. Bring a valid ID and any required documents. Fees vary by certificate type.",
    "documents_required": "Please bring a valid ID and any referral or medical documents. Students should present their school ID if required.",
    "medical_records": "To request medical records, submit a request in the Medical Records section of the app or email the clinic. Processing time and a nominal fee may apply.",
    "prescriptions": "Prescriptions are provided after consultation. For refill requests, contact the clinic or follow the refill flow in the app.",
    "fees_payment": "We accept cash and card. Service fees are listed on the Services page. For an estimate, call or ask the clinic.",
    "insurance": "We accept selected insurance plans. Inform the clinic of your provider before the appointment for verification.",
    "emergency": "In case of emergency (severe bleeding, difficulty breathing, severe pain), go to the nearest ER or call emergency services. The clinic handles non-life-threatening care.",
    "teleconsult": "Teleconsultation may be available. Book a teleconsult in the app and staff will follow up with the link or call.",
    "lab_tests": "We offer basic lab tests (CBC, urine analysis). For specific tests, ask the clinic about availability and preparation instructions.",
    "referral": "If a specialist referral is needed, the clinic doctor will issue a referral and provide instructions on where to go.",
    "privacy": "We protect patient privacy. Medical records are confidential and are only shared with consent or as required by law.",
    "covid_policy": "Updated protocols may apply for respiratory illnesses. If you have fever or symptoms, inform the clinic before arriving for proper routing.",
    "online_portal": "The online portal is used for booking, viewing records, and receiving notifications. Report portal issues to support.",
    "account_help": "For account issues (forgot password, profile update), use the Forgot Password link or update profile in app settings. For help, email support.",
    "thanks": "You’re welcome — DocuMed Clinic is here to help. If you have more questions, ask here or contact the clinic.",
    "default": "Sorry, AI is not available right now. For quick help: Check our hours: Mon–Fri 08:00–17:00; book an appointment via the Book Appointment page or email clinic@documed.com."
  }
}
